{
  "categories": ["work-experience"],
  "data": {
    "work-experience": {
      "id": "work-experience",
      "title": "Work Experience",
      "items": [
        "modernloop",
        "open",
        "mloop",
        "plg",
        "moxie",
        "hof-intern",
        "inGnious",
        "hof",
        "iauro",
        "ntu"
      ],
      "data": {
        "modernloop": {
          "id": "modernloop",
          "tab-title": "ModernLoop",
          "title": "Product Manager Intern",
          "date": "Jun 2024 - Aug 2024",
          "location": "Remote",
          "content": [
            "Conducted user research and created product requirement documents for a B2B SaaS platform.",
            "Collaborated with cross-functional teams to develop and prototype innovative solutions.",
            "Managed multiple projects, including Zoom Hosts Pool, Feedback Writing Time, and Buffer Time."
          ]
        },
        "open": {
          "id": "open",
          "tab-title": "Open Education Technologies",
          "title": "Product Marketing Intern",
          "date": "Jun 2024 - Aug 2024",
          "location": "Philadelphia, Pennsylvania, United States · Remote",
          "content": [
            "Conducted market research and competitor analysis to enhance marketing strategies.",
            "Developed SEO-friendly content and assisted in digital marketing campaigns.",
            "Managed social media platforms and email marketing initiatives.",
            "Assisted with CRM tasks and customer data analysis."
          ]
        },
        "mloop": {
          "id": "mloop",
          "tab-title": "ModernLoop",
          "title": "Software Engineer",
          "date": "Nov 2022 - Aug 2023",
          "location": "Pune, India (Remote)",
          "content": [
            "Primarily contributed to the frontend development of the ModernLoop web app using React JS and GraphQL.",
            "Led the development of the Upcoming Events user-facing dashboard. After quantitative analysis, the feature was highly praised by eight users, which led to a 15% increase in user satisfaction and user feedback was integrated into the app.",
            "Collaborated across teams, participated in design jams with UI/UX designers, brainstormed product ideas and assessed project outcomes with product managers, and optimized app performance while introducing new coding standards like GraphQL fragments among developers.",
            "Independently developed an innovative AI-powered system for auto-generating email templates, reducing email template generation times by 80%, saving an average of 4 hours per recruiter per week."
          ]
        },
        "plg": {
          "id": "plg",
          "tab-title": "PLG Works",
          "title": "Mobile App Developer",
          "date": "Apr 2022 - Nov 2022",
          "location": "Pune, India (Remote)",
          "content": [
            "Worked primarily on building iOS & Android applications using native programming as well as cross platform frameworks like React Native.",
            "Participated in the Twitter Chirp Developer Challenge 2022: Built Canary",
            "PLG Ambassador for React Native: Authored 13 blogs and multiple Github PR contributions",
            "Participated in the PLG Works Hackathon 2022: Built Spell-A-Bee",
            "Gained experience working in an agile environment.",
            "Collaborated with product, UX, and other engineering teams to improve the application experience."
          ]
        },
        "moxie": {
          "id": "moxie",
          "tab-title": "Moxie People Inc.",
          "title": "React Native Developer",
          "date": "Jun 2021 - Apr 2022",
          "location": "Pune, India (Remote)",
          "content": [
            "Worked primarily on the iOS & Android Moxie Platform mobile application which was based on the React-Native framework.",
            "Completed 11 projects during my tenure which included introduction of new features, a complete redesign, and general improvements to the application.",
            "Gained experience working in an agile environment.",
            "Collaborated with product, UX, and other engineering teams to improve the application experience."
          ]
        },
        "hof-intern": {
          "id": "hof-intern",
          "tab-title": "University of Applied Sciences, Hochschule Hof",
          "title": "Research Intern & Web Developer",
          "date": "Jan 2021 - Jun 2021",
          "location": "Hof, Bavaria, Germany (Remote)",
          "content": [
            "Worked on a full-stack e-commerce web application using ReactJS, Fastify and MongoDB.",
            "Worked on geospatial data storage and visualization.",
            "Led a team with American and French students in an international hackathon.",
            "Conducted seminars on Fastify and GeoNode."
          ]
        },
        "inGnious": {
          "id": "inGnious",
          "tab-title": "inGnious Pvt. Ltd.",
          "title": "Unity 3D Developer",
          "date": "Jun 2020 - Aug 2020",
          "location": "Pune, India (Remote)",
          "content": [
            "Developed an application automating the process of dynamc clothing simulation and avatar customisation in Unity 3D."
          ]
        },
        "hof": {
          "id": "hof",
          "tab-title": "University of Applied Sciences, Hochschule Hof",
          "title": "Semester Exchange Student",
          "date": "Oct 2019 - Feb 2020",
          "location": "Hof, Bavaria, Germany",
          "content": [
            "Worked on projects in the fields of software engineering, cybersecurity, mobile computing, and database management systems with students from a variety of nationalities like Germans, Japanese, Kazakhs, French, etc."
          ]
        },
        "iauro": {
          "id": "iauro",
          "tab-title": "iauro Systems Pvt. Ltd.",
          "title": "Software Engineer Intern",
          "date": "Jun 2018 - Aug 2018",
          "location": "Pune, India",
          "content": [
            "Researched about different technologies sued for building chatbots and finally developed a chatbot with an open-source software - BotPress"
          ]
        },
        "ntu": {
          "id": "ntu",
          "tab-title": "Nanyang Technological University, Singapore",
          "title": "Global Intern",
          "date": "Dec 2017 - Jan 2018",
          "location": "Singapore",
          "content": [
            "Completed Global internship program at Nanyang Technological University, Singapore."
          ]
        }
      }
    }
  }
}
